{
    "page": 8,
    "name": "Sobre Nós",
    "elements": {
        "banner": { "id": 8, "content": "https://banner8.png" },
        "titles": [
            { "id": 1, "content": "Visão Geral", "text-id": 1 },
            { "id": 2, "content": "Equipe", "text-id": null }
        ],
        "texts": [
            { "id": 1, 
            "content": "Nosso time busca juntar informações espalhadas na web sobre basquete e compactá-las em um só lugar. Queremos transbordar nossa paixão em informação e espalhá-la por todo Brasil. Em uma pátria tão hostil com o esporte, visamos ajudar passionistas a se encontrarem e não perderem a esperança."}
        ],
        "gang": [
            {
            "id": 1,
            "position": "Scrum Master",
            "name": "Rebeca N. Moreira da Costa",
            "text": "Desenvolvedora de Sistemas Júnior e Estudante de Sistemas de Informação. Desde que me entendo por gente, basquete faz parte da minha história. Sou torcedora #MinasNaVeia e comecei a praticar basquete com 8 anos. Porém, devido à correria da vida, me afastei da prática. Independente disso, até hoje, minha paixão pelo esporte é inexplicável e busco demonstrar um pouco dela com nosso projeto BBN."
            },
            {
            "id": 2,
            "position": "Tech Lead",
            "name": "Daniel Isaac V. Rodrigues",
            "text": "Estudante de Sistemas de Informação e apaixonado por esportes desde sempre, descobri no basquete uma nova paixão em 2020, quando assisti a alguns vídeos de melhores momentos do Stephen Curry. Aqueles arremessos incríveis e a dinâmica do jogo me conquistaram de imediato. Desde então, me tornei torcedor do Golden State Warriors e passei a acompanhar o basquete de perto — dos highlights às estatísticas. Mesmo com a rotina intensa dos estudos, sempre encontro tempo para me conectar com o esporte. Hoje com o BBN, busco unir meus conhecimentos em tecnologia com o universo do basquete, explorando maneiras criativas de integrar inovação ao jogo que tanto me inspira."
            },
            {
            "id": 3,
            "position": "Developer",
            "name": "Guilherme Henrique Costa",
            "text": "Desde criança, duas coisas sempre me acompanharam: a tecnologia e o basquete. Hoje, como estudante de Sistemas de Informação, vejo como esses dois mundos se conectam de formas surpreendentes. Minha história com o esporte começou um pouco tarde. Apesar de sempre assistir aos jogos, só comecei a jogar aos 15 anos, inspirado pelo time Los Angeles Lakers. O basquete não era apenas um jogo, mas uma escola de disciplina e trabalho em equipe. Com o tempo, a rotina exigiu que eu me afastasse um pouco das partidas, mas nunca deixei de acompanhar e admirar meu time de coração. Foi essa paixão que me levou ao projeto BBN, onde busco unir programação e basquete."
            },
            {
            "id": 4,
            "position": "Developer",
            "name": "Gustavo Fortini T. Moreira",
            "text": "Estudante de Sistemas de Informação e entusiasta de tecnologia desde cedo, sempre encontrei no esporte — especialmente no basquete — uma forma de me expressar e crescer. Meu contato com o basquete começou na adolescência, quando um amigo me levou para assistir a uma partida local. Desde então, me apaixonei pelo jogo, pelos fundamentos e pela energia das quadras. Mesmo com a rotina puxada dos estudos e projetos, nunca deixei de acompanhar os jogos e aprender com o esporte. Hoje, tenho a chance de unir minhas duas paixões no projeto BBN, onde exploramos como a programação pode impulsionar o basquete com inovação e criatividade."
            }
        ]
    }
}